# Задание 1
# Даны две строки. Выведите на экран символы, которые есть в обоих строках.

stroka1 = {'м', 'д', 'о', 'ы', 'ь', 'э', 'с', 'б', 'е', 'л', 'р', 'Д', 'в', ',', 'т', 'и', 'н', 'х', 'а', 'В', 'к'}
stroka2 = {'д', 'э', 'л', '1', '2'}
stroka3 = stroka1.intersection(stroka2)
print(stroka3)
