# Задание 2
# Опишите классы графического объекта, прямоугольника и объекта, который может обрабатывать
# нажатия мыши. Опишите класс кнопки. Создайте объект кнопки и обычного прямоугольника. Вызовите
# метод нажатия на кнопку.

class GrafObject:
    def click:
        print("Нажатие мыши")
